In [2]:
import pandas as pd
df=pd.DataFrame({"name":["prasad","arati","kavya","kavya","arnav","kavya"],
                "marks":[98,90,97,97,95,97]})
df

     name  marks
0  prasad     98
1   arati     90
2   kavya     97
3   kavya     97
4   arnav     95
5   kavya     97

In [10]:
var=df.groupby('name')
var.get_group("kavya")

    name  marks
2  kavya     97
3  kavya     97
5  kavya     97

In [12]:
for x,y in var:
    print(x)
    print(y)
    print(        )

arati
    name  marks
1  arati     90

arnav
    name  marks
4  arnav     95

kavya
    name  marks
2  kavya     97
3  kavya     97
5  kavya     97

prasad
     name  marks
0  prasad     98

In [9]:
var=df.groupby('name').mean()
var

        marks
name
arati    90.0
arnav    95.0
kavya    97.0
prasad   98.0